/**
 * 投注分类常量
 * 用于赛事详情页面的标签分类
 */

export interface CategoryItem {
  name: string; // 中文名称
  type: string; // 类型标识（如 'p', 'h', 's', 'c' 等）
}

/**
 * 分类列表
 */
export const categoryList: CategoryItem[] = [
  { name: '全部', type: '-1' },
  { name: '热门', type: 'p' },
  { name: '全场', type: '' },

  { name: '让球&大/小', type: 'h' },
  { name: '半场', type: 'f' },
  { name: '单节', type: 'q' },
  { name: '总进球数', type: 's' },
  { name: '单双', type: 'oe' },
  { name: '比分', type: 'cs' },
  { name: '罚牌', type: 'b' },
  { name: '角球', type: 'c' },
  { name: '时间类', type: 't' },
  { name: '球员', type: 'pa' },
  { name: '球队', type: 'te' },
  { name: '特殊玩法', type: 'i' },
  { name: '点球大战', type: 'ps' },
  { name: '赛局', type: 'j' },
  {
    name: '其它',
    type: 'o',
  },
  { name: '赛局', type: 'game' },
  { name: '赛局', type: 'inning' },
  { name: '赛局', type: 'vset' },
  { name: '赛盘', type: 'set' },
];

// 需要取 nm 字段作为投注选项名称的数组
export const anotherName: number[] = [
  1033, 1018, 1012, 1076, 1030, 1032, 1031, 1079, 177012, 178009, 5015, 7010, 6015, 1078, 3014,
  3017, 3030, 3027, 1075, 1077,
];

// 需要取 li 字段的盘口
export const liName: number[] = [
  15002, 15003, 1007, 178004, 178005, 178002, 5003, 5008, 5009, 7002, 7004, 7005, 6005, 6004, 6002,
  2002, 2005, 2006, 3013, 3003, 3012, 177002, 1063, 1010, 1021, 1022, 13003, 47003,
];

// fb让球/大小盘口类型 mty字段 数组
export const fbHandBigArray: number[] = [
  1000, 1002, 1007, 1010, 1011, 1021, 1022, 1057, 1058, 1063, 1065, 1066, 1067, 1068, 1086, 1087,
  3002, 3003, 3012, 3013, 2001, 2002, 2005, 2006, 15002, 15003, 13002, 13003, 5002, 5003, 5004,
  5008, 5009, 7001, 7002, 7004, 7005, 7011, 7012, 47002, 47003, 16001, 16002, 16004, 16005, 6001,
  6002, 6004, 6005, 6016, 6017, 177001, 177002, 177004, 177005, 177013, 178001, 178002, 178004,
  178005,
];

// fb 独赢盘口类型
export const fbWinArray: number[] = [
  1005, 1006, 1009, 1016, 1017, 1019, 1061, 1069, 1088, 1089, 1090, 3001, 3004, 3008, 3017, 3020,
  3021, 3029, 3032, 3034, 3035, 3036, 2003, 2007, 2009, 2010, 2011, 15001, 15008, 13001, 13006,
  5001, 5012, 5013, 7003, 7006, 7008, 47001, 47006, 47008, 16003, 16006, 16008, 16009, 16012, 16013,
  16014, 16017, 6003, 6009, 6010, 6018, 6019, 177003, 177006, 177008, 177009, 177010, 177011,
  178003, 178007, 178008,
];

// fb 比分盘口类型
export const fbPointArray: number[] = [
  1099, 1188, 1192, 1100, 1111, 1123, 2012, 15004, 15005, 13004, 13005, 5006, 5007, 5011, 47004,
  47005, 16022, 16023, 16024, 16025,
];
