export const activityTextSections = [
  {
    title: '活动时间',
    content: '2025-07-04至2026-05-01',
  },
  {
    title: '活动内容',
    content: '投注早盘2025-2026五大联赛冠军盘注单，即可获得投注额50%的返还彩金，最高1288元！',
  },
  {
    title: '活动详情',
    content: [
      '活动对象：OP7全站会员',
      '活动场馆：OP/EB体育场馆\n\n',
      '1.此活动彩金仅限体4育场馆游戏，彩金3倍体育流水即可提现。本活动注单不与其他活动共享。',
      '2.投注2025-2026五大联赛冠军盘注单，投注成功后，即可凭注单号（或购买ID）申领投注额返还彩金；VIP等级以投注时北京时间所在等级为准。',
      '3.申请条件：本活动每位会员可参与一次，本活动注单不含提前结算及串关；注单投注期限截止至对应联赛最后一轮比赛前，逾期投注申请无效；注单赔率不得低于欧赔1.5。',
      '4.举例：会员A（VIP7）于8月投注2025-2026英超冠军盘利物浦队1000元，投注成功后，则会员A可于活动页面申领返还500元彩金。',
    ],
  },
];

export const rules = [
  '1.此活动彩金仅限体4育场馆游戏，彩金3倍体育流水即可提现。本活动注单不与其他活动共享。',
  '2.投注2025-2026五大联赛冠军盘注单，投注成功后，即可凭注单号（或购买ID）申领投注额返还彩金；VIP等级以投注时北京时间所在等级为准。',
  '3.申请条件：本活动每位会员可参与一次，本活动注单不含提前结算及串关；注单投注期限截止至对应联赛最后一轮比赛前，逾期投注申请无效；注单赔率不得低于欧赔1.5。',
  '4.举例：会员A（VIP7）于8月投注2025-2026英超冠军盘利物浦队1000元，投注成功后，则会员A可于活动页面申领返还500元彩金。',
];
