/** 活动规则文案 */
export const defaultRules1 = {
  timeRange: '2025-06-21 至 2025-07-31',
  description:
    '活动期间，邀请好友注册OP7，享邀请礼金+累计奖励+VIP等级传承+永久返利！四重邀请礼金等你来拿！邀请朋友越多奖励越高！',
  rules: [
    {
      id: 11,
      content: '1.此活动彩金不限游戏类型除彩票，彩金1倍流水即可提款。',
    },
    {
      id: 12,
      content:
        '2.参与方式：受邀人注册后完成首笔存款达到对应档位，邀请人即可于本页面手动领取奖励，领取有效期为3个月。每位受邀人人数至多可激活一次邀请人奖励。',
    },
    {
      id: 13,
      content: '3.有效受邀人条件：受邀人注册后完成首笔存款并满足对应档位要求。',
    },
    {
      id: 14,
      content: '4.限制说明：受邀人闪客凑数则不计算。',
    },
    {
      id: 15,
      content:
        '5.平台会对参与活动的会员进行复存率及有效投注进行审核，若因此被风控限制，则平台有权取消此用户参与资格（如刚好达标新增标准视为凑数一次性玩家一律不计算，需要玩家多充值娱乐常驻且无多账号情况）。',
    },
  ],
  popTitle: '有效绑定条件：体育/棋牌/电竞/真人/电子任一完成有效流水≥3888（不包含不计算返水的游戏）',
  popList: [
    {
      id: 1,
      content: '1.此活动彩金不限游戏类型除彩票，彩金1倍流水即可提款。',
    },
    {
      id: 2,
      content:
        '2.参与方式：受邀人注册后完成首笔存款达到对应档位，邀请人即可于本页面手动领取奖励，领取有效期为3个月。每位受邀人人数至多可激活一次邀请人奖励。',
    },
    {
      id: 3,
      content:
        '3.经您专属邀请链接或邀请码注册的用户才能计算为您的受邀人，已注册用户无法填写邀请码。',
    },
    {
      id: 4,
      content: '4.受邀人如未在20天内达成有效绑定条件，系统将会自动解除邀请关系。',
    },
    {
      id: 5,
      content:
        '5.每位玩家仅能注册一个账户，如注册多个账户，其他账户将被立即冻结，同时该行为视为滥用红利，所有盈利及红利将被取消。任何用户或团体以不正常的方式进行套取优惠，平台方保留在不通知的情况下冻结或关闭相关账户的权利。',
    },
    {
      id: 6,
      content:
        '6.参与该活动会员必须接受及遵循上述规则与条款，并接受OP7使用的红利优惠一般相关规则与条款。',
    },
    {
      id: 7,
      content: '7.OP7保留对此活动做出更改、终止的权利，并享有最终解释权。',
    },
  ],
};

export const defaultRules0 = {
  timeRange: '2025-06-21 至 2025-07-31',
  description:
    '活动期间，邀请好友注册OP7进行游戏，享邀请礼金+累计奖励+VIP等级传承+永久返利！四重邀请礼金等你来拿！邀请朋友越多奖励越高！',
  rules: [
    {
      id: 21,
      content: '1.此活动彩金不限游戏类型除彩票，彩金1倍流水即可提款。',
    },
    {
      id: 22,
      content:
        '2.参与方式：受邀人于注册时间起10天内，完成累计存款条件时，计为当前所在周期内的一次有效人数。每位受邀人至多计算一次，逾期无效。奖励将在指定日期前结算并开放领取，领取有效期为3个月。',
    },
    {
      id: 23,
      content: '3.有效受邀人条件：受邀人于注册时间起10天内，累计存款≥500元。',
    },
    {
      id: 24,
      content: '4.活动按周期计算，每月发放3次，10天为一个周期：',
    },
    {
      id: 25,
      content: '第一次：统计每月上旬（1-10号）期间达标的人数，奖励将在13号前结算并开放领取；',
    },
    {
      id: 26,
      content: '第二次：统计每月中旬（11-20号）期间达标的人数，奖励将在23号前结算并开放领取；',
    },

    {
      id: 27,
      content: '第三次：统计每月下旬（21-月底）期间达标的人数，奖励将在次月3号前结算并开放领取。',
    },
    {
      id: 28,
      content: '5.限制说明：受邀人闪客凑数则不计算。',
    },
    {
      id: 29,
      content: '6.统计说明：三个周期结算数据互不影响。',
    },
    {
      id: 210,
      content:
        '7.平台会对参与活动的会员进行复存率及有效投注进行审核，若因此被风控限制，则平台有权取消此用户参与资格（如刚好达标新增标准视为凑数一次性玩家一律不计算，需要玩家多充值娱乐常驻且无多账号情况）。',
    },
    {
      id: 211,
      content: '8.举例：',
    },
    {
      id: 214,
      content:
        '①会员A邀请新会员B于16号18:20:20注册成功，会员B在当前周期结束日20号23:59:59前完成累计存款≥500元，并通过平台审核，会员B的有效受邀人数将会被计算在第二周期（11-20号）并结算奖励；',
    },
    {
      id: 213,
      content:
        '②会员A邀请新会员B于16号18:20:20注册成功，如果会员B未在当前周期结束日20号23:59:59前完成累计存款≥500元，那么会员B需要在26号18:20:19前（10天期限内）完成累计存款≥500元，并通过平台审核，则会员B的有效受邀人数将会被计算在第三周期（21-月底）并结算奖励。',
    },
  ],

  popTitle: '有效绑定条件：体育/棋牌/电竞/真人/电子任一完成有效流水≥3888（不包含不计算返水的游戏）',
  popList: [
    {
      id: 1,
      content: '1.此活动彩金不限游戏类型除彩票，彩金1倍流水即可提款。',
    },
    {
      id: 2,
      content:
        '2.参与方式：受邀人于注册时间起10天内，完成累计存款条件时，计为当前所在周期内的一次有效人数。每位受邀人至多计算一次，逾期无效。奖励将在指定日期前结算并开放领取，领取有效期为3个月。',
    },
    {
      id: 3,
      content:
        '3.经您专属邀请链接或邀请码注册的用户才能计算为您的受邀人，已注册用户无法填写邀请码。',
    },
    {
      id: 4,
      content: '4.受邀人如未在20天内达成有效绑定条件，系统将会自动解除邀请关系。',
    },
    {
      id: 5,
      content:
        '5.每位玩家仅能注册一个账户，如注册多个账户，其他账户将被立即冻结，同时该行为视为滥用红利，所有盈利及红利将被取消。任何用户或团体以不正常的方式进行套取优惠，平台方保留在不通知的情况下冻结或关闭相关账户的权利。',
    },
    {
      id: 6,
      content:
        '6.参与该活动会员必须接受及遵循上述规则与条款，并接受OP7使用的红利优惠一般相关规则与条款。',
    },
    {
      id: 7,
      content: '7.OP7保留对此活动做出更改、终止的权利，并享有最终解释权。',
    },
  ],
};
export const defaultRules2 = {
  timeRange: '2025-06-21 至 2025-07-31',
  description:
    '活动期间，邀请好友注册OP7，享邀请礼金+累计奖励+VIP等级传承+永久返利！四重邀请礼金等你来拿！邀请朋友越多奖励越高！',
  rules: [
    {
      id: 31,
      content:
        '1.经您专属邀请链接或邀请码注册的用户才能计算为您的受邀人，已注册用户无法填写邀请码。此活动受邀人最高可直升VIP5，每位有效受邀人至多可直升一次。',
    },
    {
      id: 32,
      content: '2.参与方式：邀请人于分享邀请码页面填写有效受邀人账户，向平台申请好友直升特权。',
    },
    {
      id: 33,
      content:
        '3.有效受邀人条件：受邀人体育/棋牌/电竞/真人/电子任意类型有效流水≥3888（不包含不计算返水的游戏）。',
    },
  ],
  popTitle: '有效绑定条件：体育/棋牌/电竞/真人/电子任一完成有效流水≥3888（不包含不计算返水的游戏）',
  popList: [
    {
      id: 1,
      content:
        '1.经您专属邀请链接或邀请码注册的用户才能计算为您的受邀人，已注册用户无法填写邀请码。此活动受邀人最高可直升VIP5，每位有效受邀人至多可直升一次。',
    },
    {
      id: 2,
      content: '2.参与方式：邀请人于分享邀请码页面填写有效受邀人账户，向平台申请好友直升特权。',
    },
    {
      id: 3,
      content: '3.受邀人如未在20天内达成有效绑定条件，系统将会自动解除邀请关系。',
    },
    {
      id: 4,
      content: '4.vip传承将根据邀请人的实时等级。',
    },
    {
      id: 5,
      content:
        '5.每位玩家仅能注册一个账户，如注册多个账户，其他账户将被立即冻结，同时该行为视为滥用红利，所有盈利及红利将被取消。任何用户或团体以不正常的方式进行套取优惠，平台方保留在不通知的情况下冻结或关闭相关账户的权利。',
    },
    {
      id: 6,
      content:
        '6.参与该活动会员必须接受及遵循上述规则与条款，并接受OP7使用的红利优惠一般相关规则与条款。',
    },
    {
      id: 7,
      content: '7.OP7保留对此活动做出更改、终止的权利，并享有最终解释权。',
    },
  ],
};
export const defaultRules3 = {
  timeRange: '2025-06-21 至 2025-07-31',
  description:
    '活动期间，邀请好友注册OP7，享邀请礼金+累计奖励+VIP等级传承+永久返利！四重邀请礼金等你来拿！邀请朋友越多奖励越高！',
  rules: [
    {
      id: 41,
      content: '1.此活动彩金不限游戏类型除彩票，彩金1倍流水即可提款。',
    },
    {
      id: 42,
      content: '2.参与方式：好友注册后，于20天内完成有效受邀人条件，邀请人即可享永久返水奖励！',
    },
    {
      id: 43,
      content:
        '3.有效受邀人条件：受邀人体育/棋牌/电竞/真人/电子任意类型有效流水≥3888（不包含不计算返水的游戏）。',
    },
    {
      id: 44,
      content:
        '4.发放时间：完成有效绑定后，每日结算一次返水奖励，次日00:00后开放领取，领取有效期为3个月。',
    },
    {
      id: 45,
      content:
        '5.平台会对参与活动的会员进行复审率及有效投注进行审核，若因此被风控限制，则平台有权取消此用户参与资格（如刚好达标新增标准视为凑数一次性玩家一律不计算，需要玩家多充值娱乐常驻且无多账号情况）。',
    },
    // {
    //   id: 46,
    //   content:
    //     '6.平台会对参与活动的会员进行复存率及有效投注进行审核，若因此被风控限制，则平台有权取消此用户参与资格（如刚好达标新增标准视为凑数一次性玩家一律不计算，需要玩家多充值娱乐常驻且无多账号情况）。',
    // },
  ],
  popTitle: '有效绑定条件：体育/棋牌/电竞/真人/电子任一完成有效流水≥3888（不包含不计算返水的游戏）',
  popList: [
    {
      id: 1,
      content: '1.此活动彩金不限游戏类型除彩票，彩金1倍流水即可提款。',
    },
    {
      id: 2,
      content: '2.返水方式：每日结算一次返水奖励，次日00:00后开放领取，领取有效期为3个月。',
    },
    {
      id: 3,
      content:
        '3.经您专属邀请链接或邀请码注册的用户才能计算为您的受邀人，已注册用户无法填写邀请码。',
    },
    {
      id: 4,
      content: '4.受邀人如未在20天内达成有效绑定条件，系统将会自动解除邀请关系。',
    },
    {
      id: 5,
      content:
        '5.每位玩家仅能注册一个账户，如注册多个账户，其他账户将被立即冻结，同时该行为视为滥用红利，所有盈利及红利将被取消。任何用户或团体以不正常的方式进行套取优惠，平台方保留在不通知的情况下冻结或关闭相关账户的权利。',
    },
    {
      id: 6,
      content:
        '6.参与该活动会员必须接受及遵循上述规则与条款，并接受OP7使用的红利优惠一般相关规则与条款。',
    },
    {
      id: 7,
      content: '7.OP7保留对此活动做出更改、终止的权利，并享有最终解释权。',
    },
  ],
};
